run/multShock_methaneAirGlobal_1D_const/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0.5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        0.5;
        lInf            1e3;

        // type            zeroGradient;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
